Revit 2024 API
BumpMap.BumpmapDepth Property
 The property labeled "Amount" from the "BumpMap" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018.1
Syntax
C#
public static string BumpmapDepth { get; }
Visual Basic
Public Shared ReadOnly Property BumpmapDepth As String
	Get
Visual C++
public:
static property String^ BumpmapDepth {
	String^ get ();
}
Remarks
 This property is of type "AssetPropertyDistance".
See Also
BumpMap Class
Autodesk.Revit.DB.Visual Namespace